'''
제공된 데이터는 백화점 고객이 1년간 상품을 구매한 속성데이터이다. 제공된 학습용 데이터(data/customer_train.csv)를 이용하여 백화점 구매 고객의 성별을 예측하는 모델을 개발하고, 개발한 모델에 기반하여 평가용 데이터(data/customer_test.csv)에 적용하여 얻은 성별 예측 결과를 아래 [제출형식]에 따라 csv 파일로 생성하여 제출하시오.

예측 결과는 ROC-AUC 평가지표에 따라 평가함
성능이 우수한 예측 모델을 구축하기 위해서는 데이터 정제, Feature Engineering, 하이퍼 파라미터(hyper parameter) 최적화, 모델 비교 등이 필요할 수 있음. 다만, 과적합에 유의하여야 함
[[제출 형식]]

가. CSV 파일명: result.csv(파일명에 디렉토리/폴더 지정불가
나. 예측 성별 칼럼명 : pred
다. 제출 칼럼 개수 : pred 칼럼 1개
라. 평가용 데이터 개수와 예측 결과 데이터 개수 일치 : 2,482개
[[제공 데이터]]

데이터 목록
data/customer_train.csv : 학습용 데이터, 3,500개
data/customer_test.csv : 평가용 데이터, 2,482개
평가용 데이터는 '성별' 칼럼 미제공
'''





'''
'''
