# ANOVA(분산 분석)
# t-test는 1개 또는 2개의 집단에 대해 평균 검정
# 독립변수 – 범주형, 종속변수 – 연속형으로 하는, 3개 이상의 집단 평균을 비교하는 모수 추론 방법
# "집단간분산" /"집단내분산" 기반의 F 분포를 이용해 가설을 검정하며 정규성, 등분산성, 독립성을 가정함
# "집단 간 분산"과 "집단 내 분산"을 이용해 분석하는 방법이어서 "분산분석"이라고 함
# 귀무가설 기각 시 구체적인 차이를 파악하기 위해, 사후 검정(Post Hoc test)이 필요함
# 등분산/동일 크기 표본 - Tukey검정, 등분산/다른 크기 표본 – Scheff 검정, Fisher’s LSD 검정 등이 있음




## 중요~~ !!
# .분산의 중요성
# 평균값은 동일하지만 분산 값이 다름으로 인해 전체적인 데이터의 모습이 완전히 달라 보임
# 분산이 클수록 집단의 평균값의 차이가 무의미해진다
# 집단간 평균값의 분산이 클수록, 집단내 분산이 작아질 수록 평균의 차이가 분명해진다.





